---
kind: other
id: AllMembers.T:Autodesk.Revit.UI.IControllableDropHandler
source: html/845dd56e-c513-515e-b53a-6d54f4c1fdec.htm
---
# IControllableDropHandler Members

Implement this method to inform Revit whether the drop event can be executed onto the given view.